In [90]:
import sqlite3 as db

In [37]:
conn = sqlite3.connect('test.db')

In [39]:
C = conn.cursor()

In [45]:
C.execute("""Create table emp(Fname text,Sname text,email text)""")

In [47]:
conn.commit()

In [49]:
C.execute("""insert into emp values('Sam','will','email.com')""")
C.execute("""insert into emp values('Rohit','Sharma','rohit@gmail.com')""")
C.execute("""insert into emp values('Ali','Khan','ali@gmail.com')""")
C.execute("""insert into emp values('Muskan','Raees','muskan@gmail.com')""")
C.execute("""insert into emp values('Ewesit','Ekidor','ewesitekidor@gmail.com')""")

In [51]:
conn.commit()

In [63]:
C.execute("SELECT * FROM emp")
items = C.fetchall()

In [65]:
for item in items:
    print(items)

[('Sam', 'will', 'email.com'), ('Rohit', 'Sharma', 'rohit@gmail.com'), ('Ali', 'Khan', 'ali@gmail.com'), ('Muskan', 'Raees', 'muskan@gmail.com'), ('Ewesit', 'Ekidor', 'ewesitekidor@gmail.com')]
[('Sam', 'will', 'email.com'), ('Rohit', 'Sharma', 'rohit@gmail.com'), ('Ali', 'Khan', 'ali@gmail.com'), ('Muskan', 'Raees', 'muskan@gmail.com'), ('Ewesit', 'Ekidor', 'ewesitekidor@gmail.com')]
[('Sam', 'will', 'email.com'), ('Rohit', 'Sharma', 'rohit@gmail.com'), ('Ali', 'Khan', 'ali@gmail.com'), ('Muskan', 'Raees', 'muskan@gmail.com'), ('Ewesit', 'Ekidor', 'ewesitekidor@gmail.com')]
[('Sam', 'will', 'email.com'), ('Rohit', 'Sharma', 'rohit@gmail.com'), ('Ali', 'Khan', 'ali@gmail.com'), ('Muskan', 'Raees', 'muskan@gmail.com'), ('Ewesit', 'Ekidor', 'ewesitekidor@gmail.com')]
[('Sam', 'will', 'email.com'), ('Rohit', 'Sharma', 'rohit@gmail.com'), ('Ali', 'Khan', 'ali@gmail.com'), ('Muskan', 'Raees', 'muskan@gmail.com'), ('Ewesit', 'Ekidor', 'ewesitekidor@gmail.com')]

In [67]:
conn.commit()

In [92]:
# import libraries
import pandas as pd
import sqlite3 as db

In [94]:
conn = db.connect('sqlite.db')

In [106]:
conn .execute("CREATE TABLE employees(empid INTEGER PRIMARY KEY,Firstname VARCHAR(50),Lastname VARCHAR(50))")

In [169]:
conn.execute("SELECT name FROM sqlite_master WHERE type ='table'")

In [173]:
conn.execute("INSERT INTO employees values(1,'John', 'Doe')")
conn.execute("INSERT INTO employees values(2,'Jason', 'Hale')")
conn.execute("INSERT INTO employees values(3,'Sam', 'Billing')")

In [193]:
New_employees = [(4,'Gustavo','achong'),
(5,'Samy', 'Erot' ),
(6,'Ekai', 'John' ),
(7,'Ekamais', 'Peter' ),
(8,'James', 'Abong' ),
(9,'Akidor', 'Nifah' ),
(5,'Ekidor', 'David' ),]

In [195]:
conn.execute("SELECT * FROM employees")

In [204]:
conn.commit()

In [206]:
conn.close()

In [208]:
conn = db.connect("sqlite.db")

In [210]:
df_employees = pd.read_sql_query("SELECT * FROM employees",conn)

In [212]:
df_employees

   empid Firstname Lastname
0      1      John      Doe
1      2     Jason     Hale
2      3       Sam  Billing
3      4   Gustavo   achong
4      5      Samy     Erot
5      6      Ekai     John
6      7   Ekamais    Peter
7      8     James    Abong
8      9    Akidor    Nifah

In [228]:
#removing an employee from the db
df_new =df_employees[:-1]

In [220]:
df_new

   empid Firstname Lastname
0      1      John      Doe
1      2     Jason     Hale
2      3       Sam  Billing
3      4   Gustavo   achong
4      5      Samy     Erot
5      6      Ekai     John
6      7   Ekamais    Peter
7      8     James    Abong

In [230]:
# removing 4 employees in the db
df_new =df_employees[:-4]

In [232]:
df_new

   empid Firstname Lastname
0      1      John      Doe
1      2     Jason     Hale
2      3       Sam  Billing
3      4   Gustavo   achong
4      5      Samy     Erot

In [240]:
# bring a whole list of the employees
df_new = df_employees[:]

In [242]:
df_new

   empid Firstname Lastname
0      1      John      Doe
1      2     Jason     Hale
2      3       Sam  Billing
3      4   Gustavo   achong
4      5      Samy     Erot
5      6      Ekai     John
6      7   Ekamais    Peter
7      8     James    Abong
8      9    Akidor    Nifah